scripts/tmp-ur-modify-soap-B.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <universal:UniversalRecordModifyReq
            xmlns:universal="http://www.travelport.com/schema/universal_v52_0"
            xmlns:air="http://www.travelport.com/schema/air_v52_0"
            xmlns:com="http://www.travelport.com/schema/common_v52_0"
            TraceId="trace_debug"
            AuthorizedBy="Zeeshan"
            TargetBranch="P7250866"
            Version="0"
            ReturnRecord="true">
            <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
            <universal:RecordIdentifier UniversalLocatorCode="364Z43" ProviderCode="1G" ProviderLocatorCode="GZWL0W"/>
            <universal:UniversalModifyCmd Key="mod1">
                <universal:AirAdd ReservationLocatorCode="364Z4E">
<air:AirPricingInfo Key="GQ5886TqWDKAqVdLAAAAAA==" TotalPrice="AED620" BasePrice="AED260" ApproximateTotalPrice="AED620" ApproximateBasePrice="AED260" ApproximateTaxes="AED360" Taxes="AED360" LatestTicketingTime="2026-06-25T23:59:00.000+04:00" PricingMethod="Guaranteed" Refundable="true" IncludesVAT="false" ETicketability="Yes" PlatingCarrier="GF" ProviderCode="1G"><air:FareInfo Key="GQ5886TqWDKAwVdLAAAAAA==" FareBasis="SDLIT3AE" PassengerTypeCode="ADT" Origin="DXB" Destination="BAH" EffectiveDate="2026-06-14T02:05:00.000+04:00" DepartureDate="2026-06-25" Amount="AED260" NegotiatedFare="false" NotValidBefore="2026-06-25" NotValidAfter="2026-06-25" TaxAmount="AED360.00"><common_v52_0:Endorsement Value="VALID ON GF ONLY/NON ENDO"/><air:FareRuleKey FareInfoRef="GQ5886TqWDKAwVdLAAAAAA==" ProviderCode="1G">6UUVoSldxwhBN1pYBBs+osbKj3F8T9EyxsqPcXxP0TLGyo9xfE/RMsuWFfXVd1OAly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA7KQB5l+S1sZxWa1uaqI55k3aSkvhp2ybcMvOvEKU4e9NuEYzJcmcQtN3J3NyYpz6fIoUCyoQ6BFvjMsFA/1Lb/0wHnemoMuGmLgFn3B9sPdSU8gecfbWEnMU535bvD9TJHRFfOGk1iaqFzszDqx4ej9QjXQ38+KXUPFc7ZmQhP+mpBH9wehGMFZXxRujPEFE6VglmYH7lBE/AFKEXb03hK/he9va7VDH7+F729rtUMfv4Xvb2u1Qx+/he9va7VDHxDGJun84l6GmjYuszn207WOnxkQ2WPPHvaVUAnec78/oX4l8hU3GlWczeGtvwKaYQxD1EHnaMxKe6UdHFN77kKtBnKOmMBD0qnNUuTLlgJvPX2vSDJpbfd1gTkbGoo1bG/FXJ53cxG8uuat479puQO65q3jv2m5A9JKlWXpXmt0</air:FareRuleKey><air:Brand Key="GQ5886TqWDKAwVdLAAAAAA==" BrandID="2004609" UpSellBrandID="2004608" Name="ECONOMY LIGHT" Carrier="GF" BrandTier="0002"><air:Title Type="External" LanguageCode="EN">Economy Light</air:Title><air:Title Type="Short" LanguageCode="EN">ECOLITE</air:Title><air:Text Type="ATPCO" LanguageCode="EN">THE MOST AFFORDABLE CHOICE WITH LESS FLEXIBILITYAND SERVICES</air:Text><air:Text Type="Strapline" LanguageCode="EN">Economy Light</air:Text><air:OptionalServices><air:OptionalService Type="Baggage" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0G7" Key="GQ5886TqWDKAyVdLAAAAAA==" Chargeable="Included in the brand" Tag="Other" DisplayOrder="999"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Checked Baggage Upto 25Kg</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Chargeable Baggage"/><air:Text Type="Strapline" LanguageCode="EN">Checked Baggage Upto 25Kg</air:Text><air:Title Type="External" LanguageCode="EN">Checked Baggage Upto 25Kg</air:Title></air:OptionalService><air:OptionalService Type="Baggage" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0MZ" Key="GQ5886TqWDKAzVdLAAAAAA==" SecondaryType="CY" Chargeable="Included in the brand" Tag="Carry On Hand Baggage" DisplayOrder="2"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Cabin Bags 6Kg</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Chargeable Baggage"/><air:Text Type="Strapline" LanguageCode="EN">Cabin Bags 6Kg</air:Text><air:Title Type="External" LanguageCode="EN">Cabin Bags 6Kg</air:Title></air:OptionalService><air:OptionalService Type="Baggage" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0FL" Key="GQ5886TqWDKA0VdLAAAAAA==" Chargeable="Not offered" Tag="Other" DisplayOrder="999"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Checked  Baggage Upto 30Kg</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Chargeable Baggage"/><air:Text Type="Strapline" LanguageCode="EN">Checked  Baggage Upto 30Kg</air:Text><air:Title Type="External" LanguageCode="EN">Checked  Baggage Upto 30Kg</air:Title></air:OptionalService><air:OptionalService Type="Baggage" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0C7" Key="GQ5886TqWDKA1VdLAAAAAA==" Chargeable="Not offered" Tag="Other" DisplayOrder="999"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Checked  Baggage Upto 35Kg</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Chargeable Baggage"/><air:Text Type="Strapline" LanguageCode="EN">Checked  Baggage Upto 35Kg</air:Text><air:Title Type="External" LanguageCode="EN">Checked  Baggage Upto 35Kg</air:Title></air:OptionalService><air:OptionalService Type="Baggage" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0C8" Key="GQ5886TqWDKA2VdLAAAAAA==" Chargeable="Not offered" Tag="Other" DisplayOrder="999"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Checked  Baggage Upto 40Kg</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Chargeable Baggage"/><air:Text Type="Strapline" LanguageCode="EN">Checked  Baggage Upto 40Kg</air:Text><air:Title Type="External" LanguageCode="EN">Checked  Baggage Upto 40Kg</air:Title></air:OptionalService><air:OptionalService Type="Baggage" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0I7" Key="GQ5886TqWDKA3VdLAAAAAA==" Chargeable="Not offered" Tag="Other" DisplayOrder="999"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Checked  Baggage Upto 50Kg</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Chargeable Baggage"/><air:Text Type="Strapline" LanguageCode="EN">Checked  Baggage Upto 50Kg</air:Text><air:Title Type="External" LanguageCode="EN">Checked  Baggage Upto 50Kg</air:Title></air:OptionalService><air:OptionalService Type="Baggage" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="01R" Key="GQ5886TqWDKA4VdLAAAAAA==" SecondaryType="CY" Chargeable="Not offered" Tag="Carry On Hand Baggage" DisplayOrder="2"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Cabin Bags 9Kg</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Chargeable Baggage"/><air:Text Type="Strapline" LanguageCode="EN">Cabin Bags 9Kg</air:Text><air:Title Type="External" LanguageCode="EN">Cabin Bags 9Kg</air:Title></air:OptionalService><air:OptionalService Type="Branded Fares" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="06B" Key="GQ5886TqWDKA5VdLAAAAAA==" SecondaryType="FR" Chargeable="Included in the brand" Tag="Mileage Accrual" DisplayOrder="8"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>50 Percent Miles Earned</common_v52_0:Description></common_v52_0:ServiceInfo><air:Text Type="Strapline" LanguageCode="EN">50 Percent Miles Earned</air:Text><air:Title Type="External" LanguageCode="EN">50 Percent Miles Earned</air:Title></air:OptionalService><air:OptionalService Type="Branded Fares" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="056" Key="GQ5886TqWDKA6VdLAAAAAA==" SecondaryType="RF" Chargeable="Available for a charge" Tag="Refund" DisplayOrder="4"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Refundable Ticket</common_v52_0:Description></common_v52_0:ServiceInfo><air:Text Type="Strapline" LanguageCode="EN">Refundable Ticket</air:Text><air:Title Type="External" LanguageCode="EN">Refundable Ticket</air:Title></air:OptionalService><air:OptionalService Type="Branded Fares" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="050" Key="GQ5886TqWDKA7VdLAAAAAA==" SecondaryType="SE" Chargeable="Available for a charge" Tag="Basic Seat" DisplayOrder="21"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Extra Legroom Seats</common_v52_0:Description></common_v52_0:ServiceInfo><air:Text Type="Strapline" LanguageCode="EN">Extra Legroom Seats</air:Text><air:Title Type="External" LanguageCode="EN">Extra Legroom Seats</air:Title></air:OptionalService><air:OptionalService Type="Branded Fares" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="05Z" Key="GQ5886TqWDKA8VdLAAAAAA==" SecondaryType="SE" Chargeable="Available for a charge" Tag="Seat Assignment" DisplayOrder="5"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Preferred Seats</common_v52_0:Description></common_v52_0:ServiceInfo><air:Text Type="Strapline" LanguageCode="EN">Preferred Seats</air:Text><air:Title Type="External" LanguageCode="EN">Preferred Seats</air:Title></air:OptionalService><air:OptionalService Type="Branded Fares" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="059" Key="GQ5886TqWDKA9VdLAAAAAA==" SecondaryType="VC" Chargeable="Available for a charge" Tag="Rebooking" DisplayOrder="3"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Changeable Ticket</common_v52_0:Description></common_v52_0:ServiceInfo><air:Text Type="Strapline" LanguageCode="EN">Changeable Ticket</air:Text><air:Title Type="External" LanguageCode="EN">Changeable Ticket</air:Title></air:OptionalService><air:OptionalService Type="Branded Fares" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="06R" Key="GQ5886TqWDKA+VdLAAAAAA==" SecondaryType="FR" Chargeable="Not offered" Tag="Mileage Accrual" DisplayOrder="8"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>125 Percent Miles Earned</common_v52_0:Description></common_v52_0:ServiceInfo><air:Text Type="Strapline" LanguageCode="EN">125 Percent Miles Earned</air:Text><air:Title Type="External" LanguageCode="EN">125 Percent Miles Earned</air:Title></air:OptionalService><air:OptionalService Type="Branded Fares" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="06N" Key="GQ5886TqWDKA/VdLAAAAAA==" SecondaryType="FR" Chargeable="Not offered" Tag="Percentage Miles" DisplayOrder="27"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>200 Percent Miles Earned</common_v52_0:Description></common_v52_0:ServiceInfo><air:Text Type="Strapline" LanguageCode="EN">200 Percent Miles Earned</air:Text><air:Title Type="External" LanguageCode="EN">200 Percent Miles Earned</air:Title></air:OptionalService><air:OptionalService Type="Branded Fares" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="06A" Key="GQ5886TqWDKAAWdLAAAAAA==" SecondaryType="FR" Chargeable="Not offered" Tag="Mileage Accrual" DisplayOrder="8"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>25 Percent Miles Earned</common_v52_0:Description></common_v52_0:ServiceInfo><air:Text Type="Strapline" LanguageCode="EN">25 Percent Miles Earned</air:Text><air:Title Type="External" LanguageCode="EN">25 Percent Miles Earned</air:Title></air:OptionalService><air:OptionalService Type="Branded Fares" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="06H" Key="GQ5886TqWDKABWdLAAAAAA==" SecondaryType="FR" Chargeable="Not offered" Tag="Mileage Accrual" DisplayOrder="8"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>250 Percent Miles Earned</common_v52_0:Description></common_v52_0:ServiceInfo><air:Text Type="Strapline" LanguageCode="EN">250 Percent Miles Earned</air:Text><air:Title Type="External" LanguageCode="EN">250 Percent Miles Earned</air:Title></air:OptionalService><air:OptionalService Type="Branded Fares" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="06C" Key="GQ5886TqWDKACWdLAAAAAA==" SecondaryType="FR" Chargeable="Not offered" Tag="Mileage Accrual" DisplayOrder="8"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>75 Percent Miles Earned</common_v52_0:Description></common_v52_0:ServiceInfo><air:Text Type="Strapline" LanguageCode="EN">75 Percent Miles Earned</air:Text><air:Title Type="External" LanguageCode="EN">75 Percent Miles Earned</air:Title></air:OptionalService><air:OptionalService Type="PreReservedSeatAssignment" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0B5" Key="GQ5886TqWDKADWdLAAAAAA==" Chargeable="Available for a charge" Tag="Seat Assignment" DisplayOrder="5"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Standard Seat</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Flight"/><air:Text Type="Strapline" LanguageCode="EN">Standard Seat</air:Text><air:Title Type="External" LanguageCode="EN">Standard Seat</air:Title></air:OptionalService><air:OptionalService Type="MealOrBeverage" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0B3" Key="GQ5886TqWDKAEWdLAAAAAA==" Chargeable="Included in the brand" Tag="Meals and Beverages" DisplayOrder="6"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Meals And Beverages</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Flight"/><air:Text Type="Strapline" LanguageCode="EN">Meals And Beverages</air:Text><air:Title Type="External" LanguageCode="EN">Meals And Beverages</air:Title></air:OptionalService><air:OptionalService Type="MealOrBeverage" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0LO" Key="GQ5886TqWDKAFWdLAAAAAA==" Chargeable="Not offered" Tag="Meals and Beverages" DisplayOrder="6"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Premium Meals  And Beverages</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Flight"/><air:Text Type="Strapline" LanguageCode="EN">Premium Meals  And Beverages</air:Text><air:Title Type="External" LanguageCode="EN">Premium Meals  And Beverages</air:Title></air:OptionalService><air:OptionalService Type="InFlightEntertainment" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0CL" Key="GQ5886TqWDKAGWdLAAAAAA==" SecondaryType="IT" Chargeable="Available for a charge" Tag="WiFi" DisplayOrder="7"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Wifi</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Flight"/><air:Text Type="Strapline" LanguageCode="EN">Wifi</air:Text><air:Title Type="External" LanguageCode="EN">Wifi</air:Title></air:OptionalService><air:OptionalService Type="Lounge" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="0BX" Key="GQ5886TqWDKAHWdLAAAAAA==" Chargeable="Available for a charge" Tag="Lounge Access" DisplayOrder="10"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Lounge Access</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Flight"/><air:Text Type="Strapline" LanguageCode="EN">Lounge Access</air:Text><air:Title Type="External" LanguageCode="EN">Lounge Access</air:Title></air:OptionalService><air:OptionalService Type="TravelServices" CreateDate="2026-06-12T22:05:06.395+00:00" ServiceSubCode="03P" Key="GQ5886TqWDKAIWdLAAAAAA==" SecondaryType="PO" Chargeable="Not offered" Tag="Priority CheckIn" DisplayOrder="14"><common_v52_0:ServiceData AirSegmentRef="GQ5886TqWDKAmVdLAAAAAA=="/><common_v52_0:ServiceInfo><common_v52_0:Description>Priority Check In</common_v52_0:Description></common_v52_0:ServiceInfo><air:EMD AssociatedItem="Flight"/><air:Text Type="Strapline" LanguageCode="EN">Priority Check In</air:Text><air:Title Type="External" LanguageCode="EN">Priority Check In</air:Title></air:OptionalService></air:OptionalServices></air:Brand></air:FareInfo><air:BookingInfo BookingCode="S" CabinClass="Economy" FareInfoRef="GQ5886TqWDKAwVdLAAAAAA==" SegmentRef="GQ5886TqWDKAmVdLAAAAAA==" HostTokenRef="GQ5886TqWDKApVdLAAAAAA=="/><air:TaxInfo Category="AE" Amount="AED75" Key="GQ5886TqWDKArVdLAAAAAA=="/><air:TaxInfo Category="F6" Amount="AED50" Key="GQ5886TqWDKAsVdLAAAAAA=="/><air:TaxInfo Category="TP" Amount="AED5" Key="GQ5886TqWDKAtVdLAAAAAA=="/><air:TaxInfo Category="ZR" Amount="AED5" Key="GQ5886TqWDKAuVdLAAAAAA=="/><air:TaxInfo Category="YQ" Amount="AED225" Key="GQ5886TqWDKAvVdLAAAAAA=="/><air:FareCalc>DXB GF BAH 70.78SDLIT3AE NUC70.78END ROE3.673336</air:FareCalc><air:PassengerType Code="ADT"/><air:ChangePenalty PenaltyApplies="Anytime"><air:Amount>AED170.00</air:Amount></air:ChangePenalty><air:CancelPenalty PenaltyApplies="Anytime"><air:Amount>AED280.00</air:Amount></air:CancelPenalty><air:BaggageAllowances><air:BaggageAllowanceInfo TravelerType="ADT" Origin="DXB" Destination="BAH" Carrier="GF"><air:URLInfo><air:URL>VIEWTRIP.TRAVELPORT.COM/BAGGAGEPOLICY/GF</air:URL></air:URLInfo><air:TextInfo><air:Text>25K</air:Text><air:Text>BAGGAGE DISCOUNTS MAY APPLY BASED ON FREQUENT FLYER STATUS/ ONLINE CHECKIN/FORM OF PAYMENT/MILITARY/ETC.</air:Text></air:TextInfo><air:BagDetails ApplicableBags="1stChecked"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:BagDetails><air:BagDetails ApplicableBags="2ndChecked"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:BagDetails></air:BaggageAllowanceInfo><air:CarryOnAllowanceInfo Origin="DXB" Destination="BAH" Carrier="GF"><air:TextInfo><air:Text>6K</air:Text></air:TextInfo><air:CarryOnDetails ApplicableCarryOnBags="1"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:CarryOnDetails><air:CarryOnDetails ApplicableCarryOnBags="2"><air:BaggageRestriction><air:TextInfo><air:Text>CHGS MAY APPLY IF BAGS EXCEED TTL WT ALLOWANCE</air:Text></air:TextInfo></air:BaggageRestriction></air:CarryOnDetails></air:CarryOnAllowanceInfo></air:BaggageAllowances></air:AirPricingInfo>
                    <com:HostToken Key="GQ5886TqWDKApVdLAAAAAA==">GFB10101ADT01OW01SDLIT3AE                              010001#GFB200010101NADTV3026AEBT0010000699Y7#GFMCXOX026NAEBT GF ADTSDLIT3AE</com:HostToken>
                </universal:AirAdd>
            </universal:UniversalModifyCmd>
        </universal:UniversalRecordModifyReq>
    </soapenv:Body>
</soapenv:Envelope>